pages/freelance/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Freelance | im_oisin</title>
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://imois.in/pages/freelance/">
<link rel="icon" href="../../icon/favicon.ico" sizes="16x16">
<link rel="icon" href="../../icon/icon_128x128.png" sizes="128x128">
<!--[if lt IE 9]><![endif]--><link href="https://code.jquery.com/ui/1.10.2/themes/smoothness/jquery-ui.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/cookies-eu-banner.default.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/sudoku.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/font-awesome.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/bnw.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
<meta name="author" content="Oisin Carroll">
<meta property="og:site_name" content="im_oisin">
<meta property="og:title" content="Freelance">
<meta property="og:url" content="https://imois.in/pages/freelance/">
<meta property="og:description" content="Since the start of 2022 I've been taking on occasional freelance work in game development! I've had the great opportunity to work on some really interesting problems with passionate and talented peopl">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2022-10-25T00:00:00Z">
</head>
<body>

    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://imois.in/" title="im_oisin" rel="home">
                im_oisin
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../games">Games</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../about-me">About Me</a></li>
                <li><a href="../freelance">Freelance</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Freelance
            </div>
        </div>
    </div>

    <div id="post-main" class="main">
        <div class="container">
        <p>
Since the start of 2022 I've been taking on occasional freelance work in game development! I've had the great opportunity to work on some really interesting problems with passionate and talented people.
</p>

<div id="outline-container-org634afcf" class="outline-2">
<h2 id="org634afcf">What I've done!</h2>
<div class="outline-text-2" id="text-org634afcf">
<dl class="org-dl">
<dt><b>Phone game prototype: Fabrick Boy (2022)</b></dt>
<dd>I prototyped an iphone game for Wicked Alcamy, which included some interesting procedurally generated levels and gesture controls. (Unity3d, C#)</dd>
<dt><b>Hockey game AI: Slapshot Rebound (2022)</b></dt>
<dd>I wrote the bots for <a href="https://store.steampowered.com/app/1173370/Slapshot_Rebound/">Slapshot Rebound</a>, a title by <a href="https://oddshot.gg/">Oddshot Games</a>. This used some new techniques including fast approximate physics using signed distance fields, a custom behaviour/maneuver system, bot reaction times using predicted object locations, gradient descent-based positioning and more. These make bots which are good at the game, require very low computing power, and play (roughly) like humans do. I'm looking to write a paper on what I did, so if that sounds interesting, stay tuned! (Unity3d, C#, Python)</dd>
<dt><b>Tool programming: My Familiar (2022)</b></dt>
<dd>I solved rendering (z-sort) issues for <a href="https://www.somethingclassic.net/">Something Classic Games</a> on their title <a href="https://store.steampowered.com/app/1502750/My_Familiar/">My Familiar</a>. This included writing some tools for level-designers to use, adding features to their asset importer, as well as documenting the issues for future reference (Unity3d, C#)</dd>
<dt><b>Water Shader: TBA (2022)</b></dt>
<dd>I worked with <a href="https://stormcloak.games/blog">Stormcloak Games</a> to develop a water shader for their physics-based title. The novel solution uses a procedurally generated tileset to render realtime seamless water caustics and animated edges over constantly changing blocks of water. (GLSL, Python)</dd>
<dt><b>Shader &amp; Editor work: TBA (2022)</b></dt>
<dd>I developed stylized comic-book shaders as well as a real-time spline-based house building system for LawnFlamingo for their upcoming game. (GLSL, Unity3d, C#)</dd>
<dt><b>Shader, SDF effects: <a href="http://siliconsynapse.net/">Silicone Synapse</a> (2017)</b></dt>
<dd>I developed some materials and visual effects for AlanJames Burns' VR art exhibit. These included morphing creatures using raymarching, procedural animated trees, and more.</dd>
</dl>
</div>
</div>


<div id="outline-container-org5fe06c9" class="outline-2">
<h2 id="org5fe06c9">If you're interested in hiring me…</h2>
<div class="outline-text-2" id="text-org5fe06c9">
<p>
Please get in touch! My main areas are Unity3D/ GLSL work, as well as Machine Learning (Deep Learning, NLP, Image Segmentation, Game AI).
</p>
</div>

<div id="outline-container-org4e54a3b" class="outline-3">
<h3 id="org4e54a3b">What I'm best at:</h3>
<div class="outline-text-3" id="text-org4e54a3b">
<dl class="org-dl">
<dt><b>Research</b></dt>
<dd>I can read papers, run tests, and report how I think you and/or your team should approach a problem.</dd>
<dt><b>Deep features</b></dt>
<dd>I can implement solutions to well defined problems.</dd>
<dt><b>Programming</b></dt>
<dd>Expect well architected code that's flexible and thought through.</dd>
<dt><b>Unity3d</b></dt>
<dd>although I'm a strong c++, python, java and javascript programmer too.</dd>
<dt><b>Shaders, AI (neural networks, behaviour trees…), procedural animation, optimization</b></dt>
<dd>I also have a degree in engineering (read: maths, physics).</dd>
<dt><b>Honesty!</b></dt>
<dd>If I don't think I can do something or I'm not a good fit for the problem, I'll tell you.</dd>
</dl>
</div>
</div>

<div id="outline-container-org2414a13" class="outline-3">
<h3 id="org2414a13">What I'm less good at but can still do:</h3>
<div class="outline-text-3" id="text-org2414a13">
<dl class="org-dl">
<dt><b>Full game rapid prototyping</b></dt>
<dd>especially when it could be assembled using prebuilt Unity/Unreal engine features.</dd>
<dt><b>Server things</b></dt>
<dd>I've worked with AWS stack and built some APIs, but it's not my strength.</dd>
<dt><b>Databases</b></dt>
<dd>I've used mongodb &amp; elasticsearch in the past, but again it's not something I know particularly well.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgcb68d4e" class="outline-3">
<h3 id="orgcb68d4e">What I can't do:</h3>
<div class="outline-text-3" id="text-orgcb68d4e">
<dl class="org-dl">
<dt><b>Work for free or for revshare!</b></dt>
<dd>Sorry.</dd>
</dl>
</div>
</div>
</div>
        

        </div>
    </div>

    
    <footer><div class="container">
            <div class="social">
                <div class="social-entry">
                    <a href="mailto:oisincar@gmail.com" target="_blank">
                        <i class="fa fa-envelope-o"></i>
                    </a>
                </div>


                <div class="social-entry">
                    <a href="https://github.com/oisincar" target="_blank">
                        <i class="fa fa-github"></i>
                    </a>
                </div>

                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2022         <a href="mailto:oisincar@gmail.com">Oisin Carroll</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><div id="cookies-eu-banner" style="display: none; position:fixed; bottom: 0;">
        By continuing to visit this site, you accept the use of cookies by Google Analytics and Google Adsense.
        <a href="https://imois.in/pages/privacy-policy/" id="cookies-eu-more">Read more</a>
        <button id="cookies-eu-reject">Reject</button>
        <button id="cookies-eu-accept">Accept</button>
    </div>

    
<script src="../../assets/js/cookies-eu-banner.js"></script><script>

CookiesEuBanner.prototype.setCookie = function(name, value) {
  var date = new Date();
  date.setTime(date.getTime() + this.cookieTimeout);

  document.cookie = name + '=' + value + ';expires=' + date.toGMTString() + ';path=/' + ';secure;SameSite=Lax';
}


    new CookiesEuBanner(function () {
        // Your code to launch when user accept cookies
        (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
        })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

        console.log("Enabling google analytics!");

        ga('create', 'UA-143421297-1', 'auto');
        ga('send', 'pageview');


        // TODO: Set up adsense here..??
    }, true);

</script><script src="../../assets/js/jquery-1.10.2.min.js" type="text/javascript"></script><script src="../../assets/js/headroom.min.js" type="text/javascript"></script><script src="../../assets/js/scripts.js" type="text/javascript"></script><div>
</div>
</body>
</html>
